#+TITLE: 从 initcode 到 shell 启动
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2023-11-15 Wed>
#+STARTUP: overview num indent
#+OPTIONS: ^:nil
#+PROPERTY: header-args:sh :results output :dir ../../study/os/xv6-public


* 从 initcode.S 到 init.c
[[file:../../study/os/xv6-public/initcode.S]]

1. 调用 exec 系统调用加载 sh 启动用户 shell
2. 通过系统调用 exec() 执行 /init 文件

#+BEGIN_SRC sh :results output :exports both
  make -nB fs.img | sed 's/gcc.*-c/gcc -c/' | grep init
#+END_SRC

#+RESULTS:
: gcc -c -o init.o init.c
: ld -m    elf_i386 -N -e main -Ttext 0 -o _init init.o ulib.o usys.o printf.o umalloc.o
: objdump -S _init > init.asm
: objdump -t _init | sed '1,/SYMBOL TABLE/d; s/ .* / /; /^$/d' > init.sym
: ./mkfs fs.img README _cat _echo _forktest _grep _init _kill _ln _ls _mkdir _rm _sh _stressfs _usertests _wc _zombie

* init.c 到 sh.c
[[file:../../study/os/xv6-public/init.c]]

init.c 运行 shell
1. 打开 console 文件
2. 设置 stdout, stderr
3. 循环创建 shell
   - fork 子进程启动 sh
   - 父进程等待
   - 如果子进程退出，则重新拉起 sh

* sh.c 执行，系统启动
调用 sh.c 实现用户 shell
1. 检测 console 文件打开
2. 死循环执行命令
   - 获取命令 getcmd
   - cd 命令的特殊处理
   - fork1 创建子进程
     - 父进程循环
     - 子进程解析命令并运行命令

[[file:../../study/os/xv6-public/sh.c]]
